Model: "mnist_model_min_tanh"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 6, 6, 4)           40        
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 3, 4)           0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 1, 1, 8)           296       
_________________________________________________________________
flatten_3 (Flatten)          (None, 8)                 0         
_________________________________________________________________
dense_6 (Dense)              (None, 16)                144       
_________________________________________________________________
dense_7 (Dense)              (None, 10)                170       
=================================================================
Total params: 650
Trainable params: 650
Non-trainable params: 0
Epoch 120/120
45/45 - 0s 5ms/step
loss: 0.0167 - acc: 0.9986 - val_loss: 0.1080 - val_acc: 0.9611
_________________________________________________________________